zuyih/platform-ststm32/misc/svd/STM32H533.svd
        <register>
          <name>FLASH_OPTSR2_PRG</name>
          <displayName>FLASH_OPTSR2_PRG</displayName>
          <description>FLASH option status register 2</description>
          <addressOffset>0x074</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>SRAM1_3_RST</name>
              <description>SRAM1 and SRAM3 erase upon system reset
</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SRAM1 and SRAM3 erased when a system reset occurs</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>SRAM1 and SRAM3 not erased when a system reset occurs</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM2_RST</name>
              <description>SRAM2 erase when system reset
</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SRAM2 erased when a system reset occurs</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>SRAM2 not erased when a system reset occurs.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BKPRAM_ECC</name>
              <description>Backup RAM ECC detection and correction disable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>BKPRAM ECC check enabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>BKPRAM ECC check disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM3_ECC</name>
              <description>SRAM3 ECC detection and correction disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SRAM3 ECC check enabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>SRAM3 ECC check disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM2_ECC</name>
              <description>SRAM2 ECC detection and correction disable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>SRAM2 ECC check enabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>SRAM2 ECC check disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBPD_DIS</name>
              <description>USB power delivery configuration option bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>Enabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TZEN</name>
              <description>TrustZone enable configuration bits
</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0xC3</name>
                  <description>TrustZone disabled</description>
                  <value>0xC3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xB4</name>
                  <description>TrustZone enabled</description>
                  <value>0xB4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_NSBOOTR_CUR</name>
          <displayName>FLASH_NSBOOTR_CUR</displayName>
          <description>FLASH non-secure boot register</description>
          <addressOffset>0x080</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>NSBOOT_LOCK</name>
              <description>Field locking the values of SWAP_BANK, and NSBOOTADD settings.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0xC3</name>
                  <description>SWAP_BANK and NSBOOTADD can still be modified following their individual rules.</description>
                  <value>0xC3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xB4</name>
                  <description>NSBOOTADD is frozen.</description>
                  <value>0xB4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSBOOTADD</name>
              <description>Non secure unique boot entry address
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_NSBOOTR_PRG</name>
          <displayName>FLASH_NSBOOTR_PRG</displayName>
          <description>FLASH non-secure boot register</description>
          <addressOffset>0x084</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>NSBOOT_LOCK</name>
              <description>Field locking the values of SWAP_ BANK, and NSBOOTADD settings.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0xC3</name>
                  <description>SWAP_ BANK and NSBOOTADD can still be modified following their individual rules.</description>
                  <value>0xC3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xB4</name>
                  <description>NSBOOTADD is frozen.</description>
                  <value>0xB4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSBOOTADD</name>
              <description>Non secure unique boot entry address
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SECBOOTR_CUR</name>
          <displayName>FLASH_SECBOOTR_CUR</displayName>
          <description>FLASH secure boot register</description>
          <addressOffset>0x088</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>SECBOOT_LOCK</name>
              <description>Field locking the values of UBE, SWAP_BANK, and SECBOOTADD settings.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0xC3</name>
                  <description>BOOT_UBE, SWAP_BANK and SECBOOTADD can still be modified following their individual rules.</description>
                  <value>0xC3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xB4</name>
                  <description>BOOT_UBE and SECBOOTADD are frozen.</description>
                  <value>0xB4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECBOOTADD</name>
              <description>Unique boot entry secure address
</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_BOOTR_PRG</name>
          <displayName>FLASH_BOOTR_PRG</displayName>
          <description>FLASH secure boot register</description>
          <addressOffset>0x08C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>SECBOOT_LOCK</name>
              <description>Field locking the values of UBE, SWAP_ BANK, and SECBOOTADD setting.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0xC3</name>
                  <description>BOOT_UBE, SWAP_ BANK and SECBOOTADD can still be modified following their individual rules.</description>
                  <value>0xC3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0xB4</name>
                  <description>BOOT_UBE and SECBOOTADD are frozen.</description>
                  <value>0xB4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECBOOTADD</name>
              <description>Secure unique boot entry address.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_OTPBLR_CUR</name>
          <displayName>FLASH_OTPBLR_CUR</displayName>
          <description>FLASH non-secure OTP block lock</description>
          <addressOffset>0x090</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>LOCKBL</name>
              <description>OTP block lock
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_OTPBLR_PRG</name>
          <displayName>FLASH_OTPBLR_PRG</displayName>
          <description>FLASH non-secure OTP block lock</description>
          <addressOffset>0x094</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>LOCKBL</name>
              <description>OTP block lock
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SECBB1R1</name>
          <displayName>FLASH_SECBB1R1</displayName>
          <description>FLASH secure block based register for Bank1</description>
          <addressOffset>0xA0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SECBB1</name>
              <description>Secure/non-secure 8 Kbytes flash Bank1 sector attributes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>sector (32 * (x-1) + y) in Bank1 is non secure.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>sector (32 * (x-1) + y) in Bank1 is secure.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SECBB1R2</name>
          <displayName>FLASH_SECBB1R2</displayName>
          <description>FLASH secure block based register for Bank1</description>
          <addressOffset>0xA4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SECBB1</name>
              <description>Secure/non-secure 8 Kbytes flash Bank1 sector attributes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>sector (32 * (x-1) + y) in Bank1 is non secure.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>sector (32 * (x-1) + y) in Bank1 is secure.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SECBB1R3</name>
          <displayName>FLASH_SECBB1R3</displayName>
          <description>FLASH secure block based register for Bank1</description>
          <addressOffset>0xA8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SECBB1</name>
              <description>Secure/non-secure 8 Kbytes flash Bank1 sector attributes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>sector (32 * (x-1) + y) in Bank1 is non secure.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>sector (32 * (x-1) + y) in Bank1 is secure.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SECBB1R4</name>
          <displayName>FLASH_SECBB1R4</displayName>
          <description>FLASH secure block based register for Bank1</description>
          <addressOffset>0xAC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SECBB1</name>
              <description>Secure/non-secure 8 Kbytes flash Bank1 sector attributes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>sector (32 * (x-1) + y) in Bank1 is non secure.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>sector (32 * (x-1) + y) in Bank1 is secure.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_PRIVBB1R1</name>
          <displayName>FLASH_PRIVBB1R1</displayName>
          <description>FLASH privilege block based register for Bank1</description>
          <addressOffset>0xC0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRIVBB1</name>
              <description>Privileged/unprivileged 8-Kbyte flash Bank1 sector attribute</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>sectors (32 * (x-1) + y) in Bank1 is unprivileged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>sector (32 * (x-1) + y) in Bank1 is privileged.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_PRIVBB1R2</name>
          <displayName>FLASH_PRIVBB1R2</displayName>
          <description>FLASH privilege block based register for Bank1</description>
          <addressOffset>0xC4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRIVBB1</name>
              <description>Privileged/unprivileged 8-Kbyte flash Bank1 sector attribute</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>sectors (32 * (x-1) + y) in Bank1 is unprivileged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>sector (32 * (x-1) + y) in Bank1 is privileged.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_PRIVBB1R3</name>
          <displayName>FLASH_PRIVBB1R3</displayName>
          <description>FLASH privilege block based register for Bank1</description>
          <addressOffset>0xC8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRIVBB1</name>
              <description>Privileged/unprivileged 8-Kbyte flash Bank1 sector attribute</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>sectors (32 * (x-1) + y) in Bank1 is unprivileged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>sector (32 * (x-1) + y) in Bank1 is privileged.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_PRIVBB1R4</name>
          <displayName>FLASH_PRIVBB1R4</displayName>
          <description>FLASH privilege block based register for Bank1</description>
          <addressOffset>0xCC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRIVBB1</name>
              <description>Privileged/unprivileged 8-Kbyte flash Bank1 sector attribute</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>sectors (32 * (x-1) + y) in Bank1 is unprivileged.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>sector (32 * (x-1) + y) in Bank1 is privileged.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
